# Dart ( https://dart.dev/tools )
# tap "dart-lang/dart"
# tap "eugenmayer/dockersync"
tap "mutagen-io/mutagen"
tap "pantheon-systems/external"
tap "sass/sass"
tap "universal-ctags/universal-ctags"
# Portable ASCII art graphics library
brew "aalib"
# Automate deployment, configuration, and upgrading
# Library for manipulating PNG images
brew "libpng"
# Record and share terminal sessions
brew "asciinema"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Macro processing language
brew "m4"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Dynamic, any-to-any, pixel format translation library
brew "babl"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Collection of portable C++ source libraries
brew "boost"
# Platform built on V8 to build network applications
brew "node"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Fuzzy matcher that uses std{in,out} and a native GUI
brew "choose-gui"
# Cross-platform make
brew "cmake"
# High performance code minimap generator
brew "code-minimap"
# Generic library support script
brew "libtool"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Postgres C API library
brew "libpq"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# General-purpose scripting language
brew "php", link: false
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Message bus system, providing inter-application communication
brew "dbus"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Text processing system for reStructuredText
brew "docutils"
# AST-based pattern checker for JavaScript
brew "eslint"
# Modern replacement for 'ls'
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# GNU awk utility
brew "gawk"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Compute various size metrics for a Git repository
brew "git-sizer"
# Open-source GitLab command-line tool
brew "glab"
# Source code tag system
brew "global"
# Render markdown on the CLI
brew "glow"
# X.509 and CMS library
brew "libksba"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# GNU grep, egrep and fgrep
brew "grep"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# CSS parsing and manipulation toolkit for GNOME
brew "libcroco"
# Library to render SVG files using Cairo
brew "librsvg"
# Library that implements the rsync remote-delta algorithm
brew "librsync"
# Library for converting WMF (Window Metafile Format) files
brew "libwmf"
# GNOME XML library
brew "libxml2"
# Next-gen compiler infrastructure
brew "llvm"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Hash utilities
brew "md5sha1sum", link: false
# Simple tool to make locally trusted development certificates
brew "mkcert"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql-client"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# Tool to automatically fix PHP coding standards issues
brew "php-cs-fixer"
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Ruby version manager
brew "rbenv"
# RC file (dotfile) management
brew "rcm"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# SOcket CAT: netcat on steroids
brew "socat"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Console-based network traffic monitor
brew "vnstat"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Fast file synchronization and network forwarding for remote development
brew "mutagen-io/mutagen/mutagen"
# Terminus is Pantheon's Command-line Interface (CLI)
brew "pantheon-systems/external/terminus"
# Stylesheet Preprocessor
brew "sass/sass/sass"
# GPU-based terminal emulator
cask "kitty"
# MySQL/MariaDB database management
cask "sequel-ace"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# 1Password api
cask "1password-cli"
